constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    Inlet
    {
        type            patch;
        nFaces          2185;
        startFace       2565513;
    }
    Outlet
    {
        type            patch;
        nFaces          2185;
        startFace       2567698;
    }
    AortaWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          29944;
        startFace       2569883;
    }
)

// ************************************************************************* //
