system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {

        solver          GAMG;
        smoother        DIC;
        tolerance       1e-7;
        relTol          0.0;

    }

    U
    {

        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-7;
        relTol          0.;

    }
    pFinal
    {
        $p;
        relTol          0;
    }

    UFinal
    {
        $U;
        relTol          0;
    }
}

PIMPLE
{
    momentumPredictor   on;
    nOuterCorrectors    100;
    nCorrectors         2;
    nNonOrthogonalCorrectors 1;
    pRefCell            0;
    pRefValue           0;
    turbOnFinalIterOnly no;
    consistent      yes;

residualControl
    {
        U
        {
                tolerance  1e-5;
                relTol     0;
        }
        p
        {
                tolerance  1e-4;
                relTol     0;

        }
     }

}

relaxationFactors
{
    fields
    {
        p               .99;
        pFinal 1; // Last outer loop
    }
    equations
    {
        U               .99;
        pFinal 1; // Last outer loop
       // nuTilda        1;
    }
}
