Allrun
#!/bin/bash                                                                     

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

# Get application name
application=`getApplication`

runApplication decomposePar
runParallel $application




#------------------------------------------------------------------------------



